package life

import "github.com/gin-gonic/gin"

// 1. 晨跑和晨练
//    1. 晨跑前的睡眠要好，睡足8h，在睡眠和健身之间要选择睡眠；
//    2. 晨跑时间小于40min或者距离小于5km，可以跑完再吃早饭；如果大量运动，则应该饭后歇至少1h再运动；
//    3. 晨练不会导致低血糖；
//    4. 晨练前一定要补水；
//    5. 晨练一定要注意热身，因为睡了一晚之后，动态平衡能力会短暂下降，防止扭伤；
//    6. 晨跑要由慢到快，让心肺功能慢慢提高；

// 2. **有哪些常用的HIIT动作？**
//    1. 原地小跑(5min)
//    2. 222(10min)
//        1. 腿部：开合跳、连续抬腿、抬抬大腿、踏步、转体高抬腿
//        2. 腹部：高举双臂扭腰、俄式扭腰、甩手
//        3. 手臂：圆环箭、向下推压、向上推压、扭动手臂、转转手臂
func ExerciseRss(ctx *gin.Context) {
	// 晨练
	// 晚上锻炼
}
